app/controllers/booked_lecture_rooms_controller.rb

  def index
    @booked_lecture_rooms = BookedLectureRoom.all
---
SELECT "booked_lecture_rooms".* FROM "booked_lecture_rooms"

  def create
    @booked_lecture_room = BookedLectureRoom.new(booked_lecture_room_params)

    respond_to do |format|
      if @booked_lecture_room.save
---
INSERT INTO "booked_lecture_rooms" ("name", "person", "data", "time", "hours", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Aula 13"], ["person", "M.Drozdz"], ["data", "2020-06-24"], ["time", "12:00:00"], ["hours", 2], ["created_at", "2020-06-24 12:00:53.943662"], ["updated_at", "2020-06-24 12:00:53.943662"]]

  def destroy
    @booked_lecture_room.destroy
---
DELETE FROM "booked_lecture_rooms" WHERE "booked_lecture_rooms"."id" = $1  [["id", 1]]

    def set_booked_lecture_room
      @booked_lecture_room = BookedLectureRoom.find(params[:id])
---
SELECT "booked_lecture_rooms".* FROM "booked_lecture_rooms" WHERE "booked_lecture_rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]